public/navigation/navigation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb4583ca">导航</a>
<ul>
<li><a href="#org449262f">搜索引擎</a></li>
<li><a href="#orgf53d392">多语言</a>
<ul>
<li><a href="#orgfa66c71">翻译</a></li>
<li><a href="#orgac28e47">词典</a></li>
</ul>
</li>
<li><a href="#org858194d">学术搜索</a></li>
<li><a href="#org1cc88d5">Wiki</a></li>
<li><a href="#orgcbc5bc7">专业性图书馆</a></li>
<li><a href="#orgcbec8c1">文档</a></li>
<li><a href="#orgb001954">资源</a></li>
<li><a href="#org25e0710">查询</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb4583ca" class="outline-2">
<h2 id="orgb4583ca">导航</h2>
<div class="outline-text-2" id="text-orgb4583ca">
</div>
<div id="outline-container-org449262f" class="outline-3">
<h3 id="org449262f">搜索引擎</h3>
<div class="outline-text-3" id="text-org449262f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://duckduckgo.com/">DuckDuckGo</a></td>
<td class="org-left"><a href="https://www.google.com">Google</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.bing.com">Bing</a></td>
<td class="org-left"><a href="https://www.baidu.com">屑度</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://search.ononoki.org">SearXNG</a></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf53d392" class="outline-3">
<h3 id="orgf53d392">多语言</h3>
<div class="outline-text-3" id="text-orgf53d392">
</div>
<div id="outline-container-orgfa66c71" class="outline-4">
<h4 id="orgfa66c71">翻译</h4>
<div class="outline-text-4" id="text-orgfa66c71">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://translate.google.com/">Google Translate</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.wiktionary.org/">Wiktionary</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.bing.com/Translator">Bing Translator</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.deepl.com/translator">DeepL</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.merriam-webster.com/">Merriam-Webster</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://dictionary.cambridge.org/us/translate/">Combridge Dictionary</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.translate.com/">Translate.com</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgac28e47" class="outline-4">
<h4 id="orgac28e47">词典</h4>
<div class="outline-text-4" id="text-orgac28e47">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://www.bing.com/dict">Bing dict</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://youdao.com/">有道</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.abbreviations.com/">Abbreviations.com</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.wordhippo.com/">WordHippo</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.yourdictionary.com/">YourDictionary</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.urbandictionary.com/">Urban Dictionary</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.techtarget.com/whatis/">WhatIs(技术词典)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://knowyourmeme.com/">Know Your Meme</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.stars21.com/">stars21</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://glosbe.com/">Glosbe</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://ilotokipona.com/">ilo toki pona</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://la-lojban.github.io/sutysisku/lojban/index.html">logola sutysisku</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org858194d" class="outline-3">
<h3 id="org858194d">学术搜索</h3>
<div class="outline-text-3" id="text-org858194d">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://sci-hub-links.com/">SCI-HUB Links</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://arxiv.org/">arXiv</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://libgen.li/">Library Genesis</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://scholar.google.com/">Google学术搜索</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.ixueshu.com/">爱学术</a></td>
</tr>

<tr>
<td class="org-left"><a href="http://www.cqvip.com/">维普网</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.wanfangdata.com.cn/">垃圾万方</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.cnki.net/">垃圾知网</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org1cc88d5" class="outline-3">
<h3 id="org1cc88d5">Wiki</h3>
<div class="outline-text-3" id="text-org1cc88d5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://wiki.archlinux.org/">ArchWiki</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.wikidata.org/wiki/Wikidata:Main_Page">Wikidata</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://thehiddenwiki.org/">Hidden Wiki</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://wikileaks.org/">WikiLeaks</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.wikihow.com/Main-Page">wikiHow</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://zh.moegirl.org.cn/Mainpage">萌娘百科</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://hmoegirl.info/Mainpage">H萌娘</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgcbc5bc7" class="outline-3">
<h3 id="orgcbc5bc7">专业性图书馆</h3>
<div class="outline-text-3" id="text-orgcbc5bc7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://www.marxists.org/chinese/">中文马克思主义文库</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://theanarchistlibrary.org/special/index/">The Anarchist Library</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://freecomputerbooks.com/">FreeComputerBooks.com</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://libretexts.org/">LibreTexts</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgcbec8c1" class="outline-3">
<h3 id="orgcbec8c1">文档</h3>
<div class="outline-text-3" id="text-orgcbec8c1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://ruby-doc.org/">Ruby-Doc</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://docs.ruby-lang.org/en/">ruby-lang.org</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgb001954" class="outline-3">
<h3 id="orgb001954">资源</h3>
<div class="outline-text-3" id="text-orgb001954">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://web.archive.org/">互联网档案库</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://archive.org/web/">互联网档案库</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://jingzhunyun.com/">精准云工具</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.toolnb.com/">爱资料工具</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://thepiratebay.org/index.html">The Pirate Bay</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://en.btdig.com/index.htm">BTDigg</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org25e0710" class="outline-3">
<h3 id="org25e0710">查询</h3>
<div class="outline-text-3" id="text-org25e0710">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://alternativeto.net/">AlternativeTo(查替代软件)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.topbestalternatives.com/">Top Best Alternatives(查替代软件)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://isbnsearch.org/">查ISBN号</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://fileinfo.com/">FileInfo.com(查文件类型)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.fileformat.com/">FILEFORMAT(查文件类型)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://xranks.com/">Xranks(网站排名)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://gs.statcounter.com/">Statcounter</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://plausible.io/">Plausible(网站分析)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.ip138.com/">iP138查询网</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.ranker.com/">Ranker(各种排名)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.gamesdatabase.org/">Games Database(游戏查询)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://myvideogamelist.com/">MyVideoGameList.com(游戏查询)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.igdb.com/discover">IGDB(游戏查询)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://steampeek.hu/">SteamPeak(游戏查询)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://anidb.net/">AniDB(动画查询)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://myanimelist.net/">MyAnimeList(动画查询)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://anilist.co/">AniList(动画查询)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.imdb.com/">IMDB(电影查询)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.book-info.com/index.htm">book-info.com(图书查询)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://myoji-yurai.net/">名字検索(日文名查询)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://name.sijisuru.com/">なまえさあち(姓名搜索)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.xiangha.com/">香哈(菜谱)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://zhaotaici.cn/">找台词(台词溯源)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://www.slant.co/">Slant(产品排名)</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://linux-hardware.org/">Hardware for Linux</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
</div>
</body>
</html>
